cask_args appdir: '/Applications'

# Taps
tap 'd12frosted/emacs-plus' || true
tap 'neovim/neovim' || true

# Tools
brew 'bash'
brew 'bash-completion'
brew 'cmake'  # For Emacs' vterm
brew 'coreutils'
brew 'emacs-plus@29', args: ["--with-xwidgets", "--with-imagemagick", "--with-native-comp", "--with-no-frame-refocus"]
brew 'fasd'
brew 'fd'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'git'
brew 'git-open'
brew 'htop'
brew 'imagemagick'
brew 'libgccjit'  # for emacs native compilation
brew 'libtool'  # For Emacs' vterm
brew 'ncdu'
brew 'neovim'
brew 'ranger'
brew 'ripgrep'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'wget'

# [2023-05-27 Sat] Actually need to manually pin this at 2.4.0 
# see https://www.reddit.com/r/emacs/comments/137r7j7/gnupg_241_encryption_issues_with_emacs_orgmode/
#brew 'gnupg'
